# Python Pandas Tutorial (part 5): Updating Rows and Columns 
# Modifying data with Dataframes

In [62]:
people ={
    "first": ["corey", "jane", "john"],
    "last": ["schafer", "doe", "doe"],
    "email": ["coreyschafer@gmail.com", "janedoe@email.com", "johndoe@email.com"]
}

In [63]:
import pandas as pd

df = pd.DataFrame(people)

### Modify the columns

#### This changes all the columns

In [64]:

df.columns = ["first_name", "last_name", "email"]
df

  first_name last_name                   email
0      corey   schafer  coreyschafer@gmail.com
1       jane       doe       janedoe@email.com
2       john       doe       johndoe@email.com

#### List comprihension.  
to upper <code> .upper() .lower()</code>

In [65]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                   EMAIL
0      corey   schafer  coreyschafer@gmail.com
1       jane       doe       janedoe@email.com
2       john       doe       johndoe@email.com

using <code>.replace(x,x1)</code>

In [66]:
df.columns = df.columns.str.replace(" ", "_")
df

  FIRST_NAME LAST_NAME                   EMAIL
0      corey   schafer  coreyschafer@gmail.com
1       jane       doe       janedoe@email.com
2       john       doe       johndoe@email.com

#### How to only change 'SOME COLUMNS'

In [67]:
df.rename(columns={"FIRST_NAME":"first", "LAST_NAME": "last"}, inplace = True)
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@email.com
2   john      doe       johndoe@email.com

### Update the data in the ROWS

#### How to update a single value?

In [68]:
#lets grab the row 2. Use the index
df.loc[2]

first                 john
last                   doe
EMAIL    johndoe@email.com
Name: 2, dtype: object

In [69]:
df.loc[2] = ["John", "Smith", "JohnSMith@gmail.com"]
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@email.com
2   John    Smith     JohnSMith@gmail.com

#### find the position

In [70]:
df.loc[1,['last',"EMAIL"]] = ("Doe", "JaneDoe@Gmail.com")
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       JaneDoe@Gmail.com
2   John    Smith     JohnSMith@gmail.com

In [71]:
df.loc[2,"last"] = "Doe"
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       JaneDoe@Gmail.com
2   John      Doe     JohnSMith@gmail.com

#### To change a single option, we can use the <code>.at()</code> method 
(not sure why people use this). Use loc and iloc(interger location)

In [72]:
df.at[1, "last"] = "doe"
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       JaneDoe@Gmail.com
2   John      Doe     JohnSMith@gmail.com

### Warnings.

In [73]:
#This is good for LOOK UP VALUES
filt = (df["EMAIL"] == "JaneDoe@Gmail.com")
df[filt]

  first last              EMAIL
1  jane  doe  JaneDoe@Gmail.com

In [74]:
df[filt]['last']

1    doe
Name: last, dtype: object

In [75]:
# this is the ERROR
df[filt]['last'] = "Smith"

<ipython-input-75-33e049b83e90>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = "Smith"

In [76]:
# FILTER CHANGE
df.loc[filt,"last"] = 'Smith'
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane    Smith       JaneDoe@Gmail.com
2   John      Doe     JohnSMith@gmail.com

In [77]:
#return all lowercase (CHANGE MULTIUPL ROWS)
df["EMAIL"] = df["EMAIL"].str.lower()

## More advance METHODS (4)  
<code>.apply() .map() .applymap() .replace</code>

### .apply()
#### is used for calling a function on values. Can be used on a DataFrame , or a Series object

<code>.apply()</code>

##### Using <code>.apply()</code> with series

In [78]:
# lets see the length of all our email addresses
df["EMAIL"].apply(len)

0    22
1    17
2    19
Name: EMAIL, dtype: int64

In [79]:
# can use it to update
def update_email(email):
    return email.upper()

In [80]:
df["EMAIL"].apply(update_email)

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2       JOHNSMITH@GMAIL.COM
Name: EMAIL, dtype: object

In [81]:
# lets assign
df["EMAIL"] = df["EMAIL"].apply(update_email)
df

   first     last                   EMAIL
0  corey  schafer  COREYSCHAFER@GMAIL.COM
1   jane    Smith       JANEDOE@GMAIL.COM
2   John      Doe     JOHNSMITH@GMAIL.COM

In [82]:
# using LAMDA. Back to lower
df["EMAIL"] = df["EMAIL"].apply(lambda to_lower: to_lower.lower())
df

   first     last                   EMAIL
0  corey  schafer  coreyschafer@gmail.com
1   jane    Smith       janedoe@gmail.com
2   John      Doe     johnsmith@gmail.com

#### Using <code>.apply()</code> with dataframes

In [83]:
#series
df["EMAIL"].apply(len)

0    22
1    17
2    19
Name: EMAIL, dtype: int64

In [84]:
#dataframe
df.apply(len)

first    3
last     3
EMAIL    3
dtype: int64

In [85]:
df.rename(columns={"EMAIL":"email"}, inplace = True)

In [86]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane    Smith       janedoe@gmail.com
2   John      Doe     johnsmith@gmail.com

In [87]:
len(df["email"])

3

#### Using .apply for rows and columns

In [88]:
# more .apply
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [89]:
df.apply(pd.Series.min)

first                      John
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [90]:
df.apply(pd.Series.max)

first                   jane
last                 schafer
email    johnsmith@gmail.com
dtype: object

In [91]:
df.apply(lambda x: x.min())

first                      John
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [92]:
df.apply(lambda x: x.max())

first                   jane
last                 schafer
email    johnsmith@gmail.com
dtype: object

### .applymap applies it on a individual value in the dataframe

In [93]:
df.applymap(len)

   first  last  email
0      5     7     22
1      4     5     17
2      4     3     19

In [94]:
#lets get all lowercase
df.applymap(str.lower)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane    smith       janedoe@gmail.com
2   john      doe     johnsmith@gmail.com

#### <code>.map</code> ONLY WORKS IN A SERIES. SUPBSITTE ONE VALUE FOR ANOTHER

In [95]:
df['first'] = df['first'].map({"corey":"chris", "jane": "mary"})

In [96]:
df['first'].replace({"corey":"chris", "jane": "mary"})

0    chris
1     mary
2      NaN
Name: first, dtype: object

In [97]:
# using map
df

   first     last                   email
0  chris  schafer  coreyschafer@gmail.com
1   mary    Smith       janedoe@gmail.com
2    NaN      Doe     johnsmith@gmail.com

In [98]:
large_df = pd.read_csv("Pokemon.csv")
pd.set_option('display.max_rows' , None)
pd.set_option('display.max_columns', None)

In [99]:
large_df.head(2)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False

In [100]:
large_df.rename(columns={"Name": "name"}, inplace = True)
large_df.head(0)

Empty DataFrame
Columns: [#, name, Type 1, Type 2, Total, HP, Attack, Defense, Sp. Atk, Sp. Def, Speed, Generation, Legendary]
Index: []

In [101]:
large_df.rename(columns={"name":"Name"}, inplace = True)

In [102]:
large_df["Legendary"].map({False: "no", True: "Yes"})

0       no
1       no
2       no
3       no
4       no
5       no
6       no
7       no
8       no
9       no
10      no
11      no
12      no
13      no
14      no
15      no
16      no
17      no
18      no
19      no
20      no
21      no
22      no
23      no
24      no
25      no
26      no
27      no
28      no
29      no
30      no
31      no
32      no
33      no
34      no
35      no
36      no
37      no
38      no
39      no
40      no
41      no
42      no
43      no
44      no
45      no
46      no
47      no
48      no
49      no
50      no
51      no
52      no
53      no
54      no
55      no
56      no
57      no
58      no
59      no
60      no
61      no
62      no
63      no
64      no
65      no
66      no
67      no
68      no
69      no
70      no
71      no
72      no
73      no
74      no
75      no
76      no
77      no
78      no
79      no
80      no
81      no
82      no
83      no
84      no
85      no
86      no
87      no
88      no
89      no
90      no
91      no
92      no
93      no
94      no
95      no
96      no
97      no
98      no
99      no
100     no
101     no
102     no
103     no
104     no
105     no
106     no
107     no
108     no
109     no
110     no
111     no
112     no
113     no
114     no
115     no
116     no
117     no
118     no
119     no
120     no
121     no
122     no
123     no
124     no
125     no
126     no
127     no
128     no
129     no
130     no
131     no
132     no
133     no
134     no
135     no
136     no
137     no
138     no
139     no
140     no
141     no
142     no
143     no
144     no
145     no
146     no
147     no
148     no
149     no
150     no
151     no
152     no
153     no
154     no
155     no
156    Yes
157    Yes
158    Yes
159     no
160     no
161     no
162    Yes
163    Yes
164    Yes
165     no
166     no
167     no
168     no
169     no
170     no
171     no
172     no
173     no
174     no
175     no
176     no
177     no
178     no
179     no
180     no
181     no
182     no
183     no
184     no
185     no
186     no
187     no
188     no
189     no
190     no
191     no
192     no
193     no
194     no
195     no
196     no
197     no
198     no
199     no
200     no
201     no
202     no
203     no
204     no
205     no
206     no
207     no
208     no
209     no
210     no
211     no
212     no
213     no
214     no
215     no
216     no
217     no
218     no
219     no
220     no
221     no
222     no
223     no
224     no
225     no
226     no
227     no
228     no
229     no
230     no
231     no
232     no
233     no
234     no
235     no
236     no
237     no
238     no
239     no
240     no
241     no
242     no
243     no
244     no
245     no
246     no
247     no
248     no
249     no
250     no
251     no
252     no
253     no
254     no
255     no
256     no
257     no
258     no
259     no
260     no
261     no
262    Yes
263    Yes
264    Yes
265     no
266     no
267     no
268     no
269    Yes
270    Yes
271     no
272     no
273     no
274     no
275     no
276     no
277     no
278     no
279     no
280     no
281     no
282     no
283     no
284     no
285     no
286     no
287     no
288     no
289     no
290     no
291     no
292     no
293     no
294     no
295     no
296     no
297     no
298     no
299     no
300     no
301     no
302     no
303     no
304     no
305     no
306     no
307     no
308     no
309     no
310     no
311     no
312     no
313     no
314     no
315     no
316     no
317     no
318     no
319     no
320     no
321     no
322     no
323     no
324     no
325     no
326     no
327     no
328     no
329     no
330     no
331     no
332     no
333     no
334     no
335     no
336     no
337     no
338     no
339     no
340     no
341     no
342     no
343     no
344     no
345     no
346     no
347     no
348     no
349     no
350     no
351     no
352     no
353     no
354     no
355     no
356     no
357     no
358     no
359     no
360     no
361     no
362     no
363     no
364     no
365     no
366     no
367     no
368     no
369     no
370     no
371     no
372     no
373     no
374     no
375     no
376     no
377     no
378     no
379     no
380     no
381     no
382     no
383     no
384     no
385     no
386     no
387     no
388     no
389     no
390     no
391     no
392     no
393     no
394     no
395     no
396     no
397     no
398     no
399     no
400     no
401     no
402     no
403     no
404     no
405     no
406     no
407     no
408     no
409     no
410     no
411     no
412     no
413     no
414    Yes
415    Yes
416    Yes
417    Yes
418    Yes
419    Yes
420    Yes
421    Yes
422    Yes
423    Yes
424    Yes
425    Yes
426    Yes
427    Yes
428    Yes
429    Yes
430    Yes
431    Yes
432     no
433     no
434     no
435     no
436     no
437     no
438     no
439     no
440     no
441     no
442     no
443     no
444     no
445     no
446     no
447     no
448     no
449     no
450     no
451     no
452     no
453     no
454     no
455     no
456     no
457     no
458     no
459     no
460     no
461     no
462     no
463     no
464     no
465     no
466     no
467     no
468     no
469     no
470     no
471     no
472     no
473     no
474     no
475     no
476     no
477     no
478     no
479     no
480     no
481     no
482     no
483     no
484     no
485     no
486     no
487     no
488     no
489     no
490     no
491     no
492     no
493     no
494     no
495     no
496     no
497     no
498     no
499     no
500     no
501     no
502     no
503     no
504     no
505     no
506     no
507     no
508     no
509     no
510     no
511     no
512     no
513     no
514     no
515     no
516     no
517     no
518     no
519     no
520     no
521     no
522     no
523     no
524     no
525     no
526     no
527     no
528     no
529     no
530     no
531     no
532     no
533     no
534     no
535     no
536     no
537    Yes
538    Yes
539    Yes
540    Yes
541    Yes
542    Yes
543    Yes
544    Yes
545    Yes
546     no
547     no
548     no
549    Yes
550    Yes
551    Yes
552    Yes
553    Yes
554     no
555     no
556     no
557     no
558     no
559     no
560     no
561     no
562     no
563     no
564     no
565     no
566     no
567     no
568     no
569     no
570     no
571     no
572     no
573     no
574     no
575     no
576     no
577     no
578     no
579     no
580     no
581     no
582     no
583     no
584     no
585     no
586     no
587     no
588     no
589     no
590     no
591     no
592     no
593     no
594     no
595     no
596     no
597     no
598     no
599     no
600     no
601     no
602     no
603     no
604     no
605     no
606     no
607     no
608     no
609     no
610     no
611     no
612     no
613     no
614     no
615     no
616     no
617     no
618     no
619     no
620     no
621     no
622     no
623     no
624     no
625     no
626     no
627     no
628     no
629     no
630     no
631     no
632     no
633     no
634     no
635     no
636     no
637     no
638     no
639     no
640     no
641     no
642     no
643     no
644     no
645     no
646     no
647     no
648     no
649     no
650     no
651     no
652     no
653     no
654     no
655     no
656     no
657     no
658     no
659     no
660     no
661     no
662     no
663     no
664     no
665     no
666     no
667     no
668     no
669     no
670     no
671     no
672     no
673     no
674     no
675     no
676     no
677     no
678     no
679     no
680     no
681     no
682     no
683     no
684     no
685     no
686     no
687     no
688     no
689     no
690     no
691     no
692     no
693     no
694     no
695     no
696     no
697     no
698     no
699    Yes
700    Yes
701    Yes
702    Yes
703    Yes
704    Yes
705    Yes
706    Yes
707    Yes
708    Yes
709    Yes
710    Yes
711    Yes
712    Yes
713     no
714     no
715     no
716     no
717     no
718     no
719     no
720     no
721     no
722     no
723     no
724     no
725     no
726     no
727     no
728     no
729     no
730     no
731     no
732     no
733     no
734     no
735     no
736     no
737     no
738     no
739     no
740     no
741     no
742     no
743     no
744     no
745     no
746     no
747     no
748     no
749     no
750     no
751     no
752     no
753     no
754     no
755     no
756     no
757     no
758     no
759     no
760     no
761     no
762     no
763     no
764     no
765     no
766     no
767     no
768     no
769     no
770     no
771     no
772     no
773     no
774     no
775     no
776     no
777     no
778     no
779     no
780     no
781     no
782     no
783     no
784     no
785     no
786     no
787     no
788     no
789     no
790     no
791     no
792    Yes
793    Yes
794    Yes
795    Yes
796    Yes
797    Yes
798    Yes
799    Yes
Name: Legendary, dtype: object